StartDesign
Syntax
SapObject.SapModel.DesignSteel.StartDesign
VB6 Procedure
Function StartDesign() As Long
Parameters
None
Remarks
This function starts the steel frame design.
The function returns zero if the steel frame design is successfully started; otherwise it returns a nonzero value.
The function will fail if no steel frame objects are present. It will also fail if analysis results are not available.
VBA Example
Sub StartSteelDesign()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'run analysis
 ret = SapModel.File.Save("C:\SapAPI\x.sdb")
 ret = SapModel.Analyze.RunAnalysis
 'start steel design
 ret = SapModel.DesignSteel.StartDesign
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.03.
See Also